{
  "profile": {
    "name": "Park Youmin",
    "portfolio": "Web Developer's Portfolio",
    "hello": "Hello",
    "intro1": "I am a persevering full-stack web developer",
    "intro2": "My strength lies in my curious nature and my constant inclination to ask questions and explore, which enables me to continuously grow"
  },
  "aboutme": {
    "name": "NAME",
    "resultName": "Park Youmin",
    "birth": "BIRTH",
    "resultBirth": "98.08.29",
    "address": "ADDRESS",
    "resultAddress": "Asan Chungcheongnam-do",
    "contact": "CONTACT",
    "resultContact": "010-2349-2812",
    "email": "E-MAIL",
    "resultEmail": "umin980829@naver.com",
    "school": "GRADUATE",
    "resultSchool": "Soonchunhyang University(computer science)"
  },
  "projects": {
    "function": "Keys",
    "portfolio": {
      "title": "portfolio",
      "date": "2023.09",
      "project": "personal project",
      "content1": "This website was created for portfolio purposes. ",
      "content2": "It is a project I undertook to help introduce myself through the website you are currently viewing.",
      "content3": "I hadn't used React until now, so I was learning and developing",
      "content4": "React",
      "content5": "in parallel. In this process, I was able to feel the similarities and differences between Vue.js and React, which I had been using until now. In addition to learning React, I was also learning",
      "content6": "typescript.",
      "content7": "While using typescript, I realized that error messages are more accurate compared to javascript, and it is convenient to find errors at compile time.",
      "content8": "I implemented a responsive webapp using React-Bootstrap ",
      "content9": "and used the ",
      "content10": "react-i18next",
      "content11": " library to experience multilingualism.",
      "function": "simply introduce about me, tech stack, project experience, work history"
    },
    "mps": {
      "title": "MPS 5.0 Solution",
      "date": "2023.04 ~ 2023.07",
      "project": "team project",
      "content1": "This is a website that helps multifunction device administrators manage their devices more conveniently and helps multifunction device users check their device usage history. ",
      "content2": "This is a new project that unified the previous solution for customers who felt inconvenienced by the separation of the multifunction device administrator page and the user page.",
      "content3": "In consultation with my teammates, we divided the development into frontend and backend, and I was in charge of the ",
      "content4": "Frontend",
      "content5": " and proceeded with development after learning ",
      "content6": "Vue.js",
      "content7": " for about a month. I ",
      "content8": "designed components",
      "content9": " based on the designs delivered and communicated with the designer to proceed with the project. In the process, I developed various libraries such as chart.js and datatables into ",
      "content10": "reusable components",
      "content11": " and tried to make them easy to use on multiple pages.",
      "content12": "In collaborating with the backend developers",
      "content13": " we documented and requested the APIs we needed in ",
      "content14": "GitLab Issue",
      "content15": " and communicated with them about the current backend development progress, fixes, and issues.",
      "content16": "Initially, we were building with ",
      "content17": "Webpack",
      "content18": ", but as the project grew, build times became longer, so we migrated to ",
      "content19": "Vite",
      "content20": ". After migrating, we noticed a significant increase in build speed.",
      "content21": "Not only did this project give me a better understanding of SPA, but it also gave me experience working with a lot of people.",
      "function": "multifunction printer output status, output volume trend, usage statistics (by user, by department), job history, department management, card management, consolidated log, scanned bin"
    },
    "wisdom": {
      "title": "WISDOM Solution",
      "date": "2022.11 ~ 2023.02",
      "project": "team project",
      "content1": "A website for multifunction device administrators.",
      "content2": " Allows administrators to manage devices, control usage by department and user, set watermarks and billing, and even set privacy violations and security words.",
      "content3": "As a full-stack developer, I used ",
      "content4": "JSP, javascript and Jquery",
      "content5": " for frontend tasks, and ",
      "content6": "MyBatis",
      "content7": " for backend tasks: ",
      "content8": "MSSQL, PostgreSQL",
      "content9": " using two databases",
      "content10": "In addition to maintaining the existing WISDOM solution, we also worked on specialized development at the client's request, developing fax history, personal information masking customization, and a dueling talent page.",
      "content11": "Collaborating with others using Git and Subversion for the first time in my career. I gained a better understanding of full-stack work, ",
      "content12": "including managing different versions of projects and dealing with failures, defining requirements, designing UI, and optimizing query statements.",
      "content13": "",
      "function": "multifunction device status, output status, security statistics, quota settings, watermark settings, billing management, etc."
    },
    "crm": {
      "title": "Solution CRM Website",
      "date": "2022.08 ~ 2022.10",
      "project": "personal project",
      "content1": "A website for managing customers who use multifunction printers.",
      "content2": " The existing customer management site was inaccessible on mobile and not user-friendly, so we decided to revamp it as a new hire project.",
      "content3": "As a project to increase understanding of the environment and technology used by the company, I thought deeply about the UI & UX to make it convenient for users as well as technical understanding, and ",
      "content4": "completed the design myself using Figma.",
      "content5": "",
      "content6": "By personally going through the process of requirements definition, process design, database design, UI planning and design, development, testing, and deployment to complete one project, I gained a better understanding of ",
      "content7": "the flow of a project",
      "content8": " rather than just improving my development skills.",
      "content9": "Using SpringBoot, which I hadn't been exposed to as an undergraduate, I was able to deepen my understanding of the ",
      "content10": "framework",
      "content11": " and establish the concept of MVC patterns and dependency injection.",
      "content12": "Furthermore, by implementing my first responsive webapp with BootStrap, I was able to deepen my understanding of ",
      "content13": "Grid Style.",
      "content14": "",
      "function": "customer management, server management, solution management"
    },
    "lab": {
      "title": "Laboratory Website",
      "date": "2018.07 ~ 2018.08",
      "project": "personal project",
      "content1": "This is a website to introduce undergraduate research labs.",
      "content2": "The existing lab homepage did not clearly show the research activities and purpose, so we worked on a UI renewal to improve it.",
      "content3": "Teaching myself ",
      "content4": "html, css, javascript",
      "content5": " which I lacked as an undergraduate, I was able to apply the code to the UI I designed for the free templates and further develop my understanding of javascript and Jquery by ",
      "content6": "implementing image sliders and more details",
      "content7": " on my own.",
      "content8": "This is the project that first made me fall in love with web development.",
      "function": "introduce labs and researchers, showcase research activities, share seminar materials and photo boards of research activities"
    }
  },
  "career": {
    "sindoh": {
      "title": "sindoh",
      "date": "2022.06 ~ 2023.07",
      "info": "As a full-stack web developer for multifunctional solutions, I was responsible for maintaining existing solutions, client-specific development (Spring, JAVA, JSP, MyBatis), and front-end development of new solutions (Vue.js)."
    }
  }
}
